src/OpenFOAM/OpenFOAM-7/tutorials/multiphase/interFoam/RAS/weirOverflow/Allrun
#!/bin/sh

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication setFields
runApplication $(getApplication)

#------------------------------------------------------------------------------
